In [3]:
import pandas as pd

data = pd.read_csv('data/titanic.csv')

In [27]:
print(data.shape)
print(data.info())

(891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [49]:
import pandas as pd
import numpy as np
sp = pd.read_csv('data/StudentsPerformance.csv')
sp.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [39]:
sp.loc[(sp['writing score'] > 97) & (sp['gender'] =='male')]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100

In [47]:
print('{0}  {1}'.format(sp['math score'].median(),sp['math score'].mean()))

66.0  66.089

In [50]:
sp

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [65]:
sp.loc[(sp['lunch'] == 'free/reduced'),'lunch'].count()/sp['lunch'].count()*100

35.5

In [68]:
sp.loc[(sp['lunch'] == 'free/reduced')].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

In [69]:
sp.loc[(sp['lunch'] != 'free/reduced')].describe()

       math score  reading score  writing score
count  645.000000     645.000000     645.000000
mean    70.034109      71.654264      70.823256
std     13.653501      13.830602      14.339487
min     19.000000      26.000000      22.000000
25%     61.000000      63.000000      62.000000
50%     69.000000      72.000000      72.000000
75%     80.000000      82.000000      81.000000
max    100.000000     100.000000     100.000000

In [74]:
sp.columns = sp.columns.str.replace(' ','_')
sp.columns = sp.columns.str.replace('/','_')

In [81]:
sp.query('math_score > 90 & gender == "male"')

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
34,male,group E,some college,standard,none,97,87,82
104,male,group C,some college,standard,completed,98,86,90
121,male,group B,associate's degree,standard,completed,91,89,92
149,male,group E,associate's degree,free/reduced,completed,100,100,93
171,male,group E,some high school,standard,none,94,88,78
233,male,group E,some high school,standard,none,92,87,78
286,male,group E,associate's degree,standard,completed,97,82,88
306,male,group E,some college,standard,completed,99,87,81
469,male,group C,some college,standard,none,91,74,76
539,male,group A,associate's degree,standard,completed,97,92,86
562,male,group C,bachelor's degree,standard,completed,96,90,92
571,male,group A,bachelor's degree,standard,none,91,96,92
612,male,group C,bachelor's degree,standard,completed,94,90,91
618,male,group D,master's degree,standard,none,95,81,84
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
689,male,group E,some college,free/reduced,none,93,90,83
710,male,group C,some college,standard,completed,93,84,90
719,male,group E,associate's degree,free/reduced,completed,91,73,80
736,male,group C,associate's degree,standard,none,92,79,84
779,male,group E,associate's degree,standard,completed,94,85,82
784,male,group C,bachelor's degree,standard,completed,91,81,79
815,male,group B,some high school,standard,completed,94,86,87
846,male,group C,master's degree,standard,completed,91,85,85
864,male,group C,associate's degree,standard,none,97,93,91
916,male,group E,bachelor's degree,standard,completed,100,100,100
919,male,group B,some college,standard,completed,91,96,91
934,male,group C,associate's degree,standard,completed,98,87,90
950,male,group E,high school,standard,none,94,73,71

In [91]:
score_columns = [i for i in list(sp) if 'score' in i]
sp[score_columns].tail()

     math_score  reading_score  writing_score
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

In [94]:
sp.filter(like='score')

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [106]:
sp.groupby('race_ethnicity',as_index=False).mean()

  race_ethnicity  math_score  reading_score  writing_score
0        group A   61.629213      64.674157      62.674157
1        group B   63.452632      67.352632      65.600000
2        group C   64.463950      69.103448      67.827586
3        group D   67.362595      70.030534      70.145038
4        group E   73.821429      73.028571      71.407143

In [108]:
sp.groupby('race_ethnicity').aggregate({'math_score':'mean'}).rename(columns = {'math_score':'mean_math_score'})

                mean_math_score
race_ethnicity
group A               61.629213
group B               63.452632
group C               64.463950
group D               67.362595
group E               73.821429

In [127]:
#top 5 male and top5 femail in math
sp.sort_values(['gender','math_score'],ascending=False).groupby('gender').head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [126]:
#Пересчитаем число ног у героев игры Dota2
hero = pd.read_csv('data/dota_hero_stats.csv')
hero.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [136]:
#hero.sort_values(['legs'],ascending=False).groupby('legs').count()
hero.groupby('legs').size()

legs
0    11
2    95
4     7
6     3
8     1
dtype: int64

In [178]:
#Сгруппируйте по колонкам attack_type и primary_attr и выберите самый распространённый набор характеристик.
#hero.groupby(['attack_type','primary_attr']).size()
hero.groupby(['attack_type','primary_attr']).agg({'id': 'count'}).sort_values('id',ascending=False)

                          id
attack_type primary_attr
Ranged      int           40
Melee       str           35
            agi           19
Ranged      agi           18
            str            3
Melee       int            2

In [141]:
#Сравнение среднего заработка в различных категориях 
pay = pd.read_csv('data/accountancy.csv')
pay.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [159]:
pay.groupby(['Executor','Type'],as_index=False).aggregate({'Salary':'mean'}).sort_values(['Type','Salary'])

   Executor Type      Salary
0     Loopa    A   58.000000
6      Pupa    A  160.833333
7      Pupa    B   77.000000
1     Loopa    B  145.166667
8      Pupa    C   74.500000
2     Loopa    C  154.333333
3     Loopa    D  137.714286
9      Pupa    D  146.500000
10     Pupa    E  131.200000
4     Loopa    E  164.000000
11     Pupa    F  136.250000
5     Loopa    F  238.000000

In [170]:
pay.groupby(['Type', 'Executor'], as_index=False).mean().sort_values(['Type', 'Salary'], ascending=[True, False]) \
    .groupby('Type').head(1).drop('Unnamed: 0',axis=1)

   Type Executor      Salary
1     A     Pupa  160.833333
2     B    Loopa  145.166667
4     C    Loopa  154.333333
7     D     Pupa  146.500000
8     E    Loopa  164.000000
10    F    Loopa  238.000000

In [180]:
concentrations = pd.read_csv('data/algae.csv')
concentrations

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886
5,Cladophora_compacta,Cladophora,green,5.712284,3.461692,3.082826,3.343707,1.432514
6,Cladophora_gracilis,Cladophora,green,2.452623,6.881024,5.841520,2.740165,2.829016
7,Palmaria_palmata,Palmaria,red,0.704580,3.176440,5.573905,3.242090,2.245538
8,Saccharina_latissima,Saccharina,brown,1.636122,5.793163,1.071920,3.947968,4.817804
9,Ascophyllum_nodosum,Ascophyllum,brown,6.825467,0.875429,5.253527,3.414961,2.432526

In [184]:
#найти среднюю концентрацию каждого из веществ в каждом из родов 
mean_concentrations = concentrations.groupby(['genus']).mean()
mean_concentrations

              sucrose    alanin   citrate   glucose  oleic_acid
genus
Ascophyllum  6.825467  0.875429  5.253527  3.414961    2.432526
Cladophora   4.008792  3.997055  5.288311  2.800276    2.263472
Fucus        4.355112  3.566411  4.214878  2.814803    3.367647
Palmaria     0.704580  3.176440  5.573905  3.242090    2.245538
Saccharina   4.183596  3.524207  3.346710  4.980594    4.487252

In [197]:
#чему равны минимальная, средняя и максимальная концентрации аланина (alanin) среди видов рода Fucus
concentrations.loc[concentrations['genus'] == 'Fucus','alanin'].describe()

min     0.35
mean    3.57
max     6.64
Name: Fucus, dtype: float64

In [201]:
%%timeit
concentrations.groupby('genus').agg(['min', 'mean', 'max']).loc['Fucus', 'alanin'].round(2)

20.1 ms ± 323 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [203]:
%%timeit
concentrations.loc[concentrations['genus'] == 'Fucus','alanin'].agg(['min', 'mean', 'max']).round(2)

1.48 ms ± 11 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [204]:
concentrations.loc[concentrations['genus'] == 'Fucus','alanin'].agg(['min', 'mean', 'max']).round(2)

min     0.35
mean    3.57
max     6.64
Name: alanin, dtype: float64

In [210]:
range_con = concentrations.groupby('group', as_index=False).aggregate({'sucrose': ['max', 'min']})
range_con['sucrose_range'] = range_con['sucrose']['max'] - range_con['sucrose']['min']
range_con

   group   sucrose           sucrose_range
               max       min
0  brown  6.825467  1.636122      5.189345
1  green  5.712284  2.452623      3.259662
2    red  0.704580  0.704580      0.000000

In [213]:
concentrations.groupby('group', as_index=False).size()

   group  size
0  brown     6
1  green     3
2    red     1